<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=iso-8859-15">
	<TITLE>Datenuebertragung</TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 2.0  (Linux)">
	<META NAME="CREATED" CONTENT="20041213;16464000">
	<META NAME="CHANGED" CONTENT="20051219;14312800">
</HEAD>
<BODY LANG="de-DE" DIR="LTR">
<H1>Grundlagen der Daten&uuml;bertragung</H1>
<P><BR><BR>
</P>
<P>Hier folgt keine Vorlesung &uuml;ber Daten&uuml;bertragung,
sondern eine launige Geschichte, die verdeutlichen soll, was so alles
passieren kann. Nur so viel vorweg: Die Daten laufen von Ihrem
Computer aus als elektrische Signale &uuml;ber das Modem, die ISDN
oder DSL Karte zu Ihrem Internet-Provider (Telekom, Freenet, Arcor,
AOL oder &auml;hnliche). Dort wertet ein Computer die Internet -
Zieladresse Ihres Datenpakets aus und sucht einen Weg, der in
Richtung auf das Ziel f&uuml;hrt. Auf diesen Weg schickt er die
Daten. Niemand kann vorhersagen, auf welchem Weg die Daten durch das
Netz laufen. Auf jeden Fall werden die Daten unterwegs von vielen
Computern gelesen, die Adressen ausgewertet und dann weitergeschickt.
An jedem dieser Computer k&ouml;nnen die Daten gelesen oder
verf&auml;lscht werden. 
</P>
<P>Deshalb werden die Daten vor der Daten&uuml;bertragung &uuml;ber
ein ausgekl&uuml;geltes <A HREF="security.html">Verfahren</A>
verschl&uuml;sselt. Bei HBCI mit Diskette / USB-Stick gibt es zwei
Schl&uuml;ssel, einen &ouml;ffentlichen und einen privaten. Mit dem
&ouml;ffentlichen wird verschl&uuml;sselt, mit dem privaten
entschl&uuml;sselt (siehe oben), so dass die Daten f&uuml;r Dritte
nicht einsehbar sind. 
</P>
<H3>Die Geschichte:</H3>
<P>Um es zu verdeutlichen, nehme man an &quot;Ich&quot; sei nun eine
Datei bestehend aus Ihren Kontodaten und den einzelnen Eintr&auml;gen
aus einem &Uuml;berweisungsformular. Ich bin also, da ich einen
eventuell hohen Geldbetrag enthalte, sehr wichtig und interessant f&uuml;r
b&ouml;se Buben. 
</P>
<P>Aus diesem Grund werde ich auch schon sofort nach dem Zeitpunkt
meiner Entstehung verschl&uuml;sselt. Also bestehe ich, wenn man mich
n&auml;her betrachten w&uuml;rde nur noch aus Krypt-Zeichen, so kann
mich keiner entziffern. 
</P>
<P>Dann irgendwann werde ich auf meine Reise durchs Internet
geschickt, was mit gro&szlig;en Gefahren verbunden sein kann. Doch
nicht f&uuml;r mich, denn ich bin mit einer der sichersten momentan
existenten Verschl&uuml;sselungen gesichert. 
</P>
<P>Das Internet ist gro&szlig; und es gibt dort sehr viele Personen,
die Signale, Passw&ouml;rter oder Dateien wie mich abfangen und
kopieren...und da ist es auch schon passiert. Ich wurde kopiert und
auf einen fremden Computer gezogen. Das ist nicht der Ort an den ich
hin sollte. 
</P>
<P>Nun, das Original meiner Datei ist trotzdem noch auf dem Weg und
erreicht die Bank, an die ich geschickt wurde. Jetzt bin ich auf
einem Computer eines Unbefugten, der versucht mich zu lesen. Aber ich
bestehe immer noch aus solchen Krypt-Zeichenketten und selbst wenn er
alles versuchen sollte um meine Verschl&uuml;sselung zu knacken wird
er es dennoch nicht schaffen. Und mir kann es schlie&szlig;lich egal
sein, ich bin nur eine Datei und wei&szlig; es nicht einmal. 
</P>
<P>Das Original von mir ist unterdessen an der Bank angelangt und
wird auf die korrekte Weise entschl&uuml;sselt, was nur die Bank
kann. 
</P>
<P>Dann werden die Informationen in mir ausgewertet, verarbeitet und
der Auftrag ausgef&uuml;hrt. 
</P>
<P>Dies nur als kleine Verdeutlichung der sicheren Daten&uuml;bertragung.
</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<TABLE WIDTH=100% BORDER=1 CELLPADDING=4 CELLSPACING=3>
	<COL WIDTH=85*>
	<COL WIDTH=85*>
	<COL WIDTH=85*>
	<TR VALIGN=TOP>
		<TD WIDTH=33%>
			<P><A HREF="index.html">zum Inhaltsverzeichnis</A></P>
		</TD>
		<TD WIDTH=33%>
			<P><A HREF="linux-operating.html">zur vorhergehenden Seite</A></P>
		</TD>
		<TD WIDTH=33%>
			<P><A HREF="hbcifints.html">zur n&auml;chsten Seite</A></P>
		</TD>
	</TR>
</TABLE>
<P><BR><BR>
</P>
</BODY>
</HTML>