<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=iso-8859-1">
	<TITLE></TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 1.1.1  (Linux)">
	<META NAME="CREATED" CONTENT="20041212;19281200">
	<META NAME="CHANGED" CONTENT="20050811;19315600">
</HEAD>
<BODY LANG="de-DE" DIR="LTR">
<H2>HBCI Einrichtung Seite 1: Einleitung</H2>
<P>Sie ben&ouml;tigen f&uuml;r die Inbetriebnahme von MoneyPenny von
Ihrer Bank die Zugangsdaten f&uuml;r das HBCI Verfahren. Bitte
beantragen Sie bei Ihrer Bank Internet-Banking nach dem HBCI
Verfahren (NICHT mit Pin-Tan). Anschlie&szlig;end richten Sie mit
MoneyPenny Ihre Internet-Verbindung zur Bank ein. 
</P>
<P>Bevor Sie mit der neuen Verbindung arbeiten k&ouml;nnen, m&uuml;ssen
Sie aus <A HREF="security.html">Sicherheitsgr&uuml;nden </A>den von
MoneyPenny gedruckten sogenannten Ini-Brief bei Ihrer Bank abgeben. 
</P>
<P>Sie sollten von Ihrer Bank einen Brief mit den Zugangsdaten
erhalten haben. Leider sind diese Briefe nicht einheitlich. Eventuell
haben Sie auch eine private Schl&uuml;sseldatei (private key) von
Ihrer Bank erhalten. <B>Verwenden sie nur private Schl&uuml;sseldateien,
die Sie auf dem Postwege erhalten oder die Sie selbst auf einer
Diskette abgeholt haben. &Uuml;ber das Internet (email) versendete
private Schl&uuml;sseldateien sollten Sie auf gar keinen Fall
benutzen! Siehe hierzu das Kapitel &uuml;ber <A HREF="security.html">Sicherheit</A>.</B>
</P>
<P>Im Folgenden wird der Brief besprochen, der von allen Volksbanken
und Raiffeisenbanken versendet wird. Sie ben&ouml;tigen die lange
Nummer, die als Benutzerkennung/Kundennummer bezeichnet wird. Die
kurze Kundennummer wird nicht gebraucht. Au&szlig;erdem enth&auml;lt
der Brief den &quot;Fingerprint&quot; (Fingerabdruck oder auch
Hashwert) des &ouml;ffentlichen Schl&uuml;ssels der Bank. Diese
Zahlen- und Buchstabenfolge (eine hexadezimale Zahl) sollten Sie
sp&auml;ter mit dem von MoneyPenny f&uuml;r den Bankschl&uuml;ssel
berechneten Fingerprint vergleichen. Stimmen die Werte &uuml;berein,
so wurde der &ouml;ffentliche Bankschl&uuml;ssel (public key)
fehlerfrei &uuml;ber das Internet &uuml;bermittelt. Der Rechner der
Bank, mit dem MoneyPenny Kontakt aufnehmen muss, wird Bankserver
genannt. Sein Name (URL) ist im Falle der Volksbanken: hbci.gad.de Es
kann auch sein, dass Sie statt des Namens von Ihrer Bank die
Internet-Adresse (IP-address) des Bankservers erhalten haben. Diese
Nummer sieht etwa so aus: 192.168.0.50 Tragen Sie in diesem Falle die
Internet-Adresse statt des Namens ein. 
</P>
<TABLE WIDTH=100% BORDER=1 CELLPADDING=4 CELLSPACING=3>
	<COL WIDTH=85*>
	<COL WIDTH=85*>
	<COL WIDTH=85*>
	<THEAD>
		<TR VALIGN=TOP>
			<TD WIDTH=33%>
				<P><!-- bottom navigator bar --><A HREF="index.html">zum
				Inhaltsverzeichnis</A></P>
			</TD>
			<TD WIDTH=33%>
				<P><A HREF="hbci_welcome.html">zur vorhergehenden Seite</A></P>
			</TD>
			<TD WIDTH=33%>
				<P><A HREF="hbci_bank.html">zur n&auml;chsten Seite</A></P>
			</TD>
		</TR>
	</THEAD>
</TABLE>
<P><BR><BR>
</P>
</BODY>
</HTML>