<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=iso-8859-1">
	<TITLE>HBCI und FinTS</TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 1.1.1  (Linux)">
	<META NAME="CREATED" CONTENT="20041213;16464000">
	<META NAME="CHANGED" CONTENT="20050320;19230700">
</HEAD>
<BODY LANG="de-DE" DIR="LTR">
<H1>Was ist HBCI und FinTS?</H1>
<P><BR><BR>
</P>
<H2>HBCI</H2>
<P>HBCI steht f&uuml;r Home Banking Computer Interface, ein deutscher
Standard, der vom Zentralen Kreditausschuss (ZKA) entwickelt worden
ist. HBCI definiert sicheres, multibankf&auml;higes Online-Banking
zwischen Kundensystemen und Bankrechnern. 
</P>
<P>Der Banking Kernel f&uuml;r HBCI befindet sich im Kundensystem
(bei MoneyPenny 1.0 ist das OpenHBCI 2, bei kommerziellen Programmen
meist der PPI Kernel) und erm&ouml;glicht einer Anwendung, zusammen
mit anderen anwendungsunabh&auml;ngigen Komponenten, Online-Banking
mit der Hilfe von HBCI durchzuf&uuml;hren.  Er kommuniziert &uuml;ber
das Internet mit dem HBCI-Server der Bank.</P>
<H2>FinTS</H2>
<P>Der folgende Text wurde weitgehend von <A HREF="http://www.fints.de/">www.fints.de</A>
&uuml;bernommen.</P>
<P>FinTS steht f&uuml;r Financial Transaction Services und ist die
Weiterentwicklung des 1996 erstmals vom ZKA (Zentraler
Kreditausschuss) ver&ouml;ffentlichten Online-Banking Standards: Home
Banking Computer Interface (HBCI). 
</P>
<P>Damals wie heute ist das Ziel dieses Standards die
Vereinheitlichung der Schnittstelle zwischen dem Bankkunden - z. B.
repr&auml;sentiert durch seine Finanzverwaltungs-Software - und einem
oder mehreren Kreditinstituten in identischer Weise. Ziel ist dabei
die Multibankf&auml;higkeit. 
</P>
<P>Der Funktionsumfang von HBCI ist seit seiner ersten
Ver&ouml;ffentlichung 1995 stark angestiegen, um den Anforderungen
des Marktes zu gen&uuml;gen: zahlreiche neue Gesch&auml;ftsvorf&auml;lle
im Wertpapierbereich, genauso wie die kontinuierliche Verfeinerung
der Sicherheitstechnik wurden hinzugef&uuml;gt. 
</P>
<P>Einen Meilenstein stellte dabei der 2002 ver&ouml;ffentlichte
Nachfolgestandard FinTS (Financial Transaction Services) dar. FinTS
bedeutet in vielerlei Hinsicht eine entscheidende Weiterentwicklung:
Der Schritt von Homebanking zu Online-Banking: mit neuen
Rollenmodellen und Kommunikationsm&ouml;glichkeiten geht der Standard
neue Wege und erm&ouml;glicht die Nutzung des Protokolls f&uuml;r
alle elektronischen Vertriebswege. 
</P>
<P>Die Einf&uuml;hrung der ZKA Banken-Signaturkarte in Verbindung mit
modernsten kryptografischen Verfahren einerseits und die &Ouml;ffnung
von FinTS f&uuml;r alternative Sicherheitsverfahren - allen voran sei
hier das bew&auml;hrte PIN/TAN-Verfahren genannt - erschliesst neue
Perspektiven f&uuml;r die breite Einf&uuml;hrung von FinTS in jeder
Gesch&auml;ftssituation. 
</P>
<P>Ziel ist es dabei, die gro&szlig;e Anzahl der attraktiven
FinTS-Gesch&auml;ftsvorf&auml;lle (mehrere hundert St&uuml;ck) mit
jedem ben&ouml;tigten Sicherheitsverfahren und jedem geforderten
Kommunikationsweg im FinTS-Protokoll anbieten zu k&ouml;nnen. 
</P>
<P>Einige Institute fanden die Unterst&uuml;tzung des
PIN/TAN-Supports so attraktiv, dass sie dieses Sicherheitsverfahren
als Migrationsschritt auch noch f&uuml;r die bestehende
HBCI-Infrastruktur als &quot;Erweiterung PIN/TAN V1.01&quot;
anbieten. 
</P>
<P>FinTS wird derzeit von mehr als 2000 Kreditinstituten unterst&uuml;tzt,
die Tendenz ist stark steigend. 
</P>
<P>Namhafte Hersteller von Online-Banking-Software unterst&uuml;tzen
den Standard, so dass der Kunde aus einer Vielzahl von Produkten
w&auml;hlen kann. 
</P>
<P>N&auml;here Informationen finden Sie auf der Seite www.fints.de
oder im FinTS-Kompendium V4.0 (ca. 920KB). 
</P>
<P STYLE="margin-bottom: 0in"><BR>
</P>
<TABLE WIDTH=100% BORDER=1 CELLPADDING=4 CELLSPACING=3>
	<COL WIDTH=85*>
	<COL WIDTH=85*>
	<COL WIDTH=85*>
	<TR VALIGN=TOP>
		<TD WIDTH=33%>
			<P><A HREF="index.html">zum Inhaltsverzeichnis</A></P>
		</TD>
		<TD WIDTH=33%>
			<P><A HREF="datatransfer.html">zur vorhergehenden Seite</A></P>
		</TD>
		<TD WIDTH=33%>
			<P><A HREF="encryption.html">zur n&auml;chsten Seite</A></P>
		</TD>
	</TR>
</TABLE>
<P><BR><BR>
</P>
</BODY>
</HTML>
