<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=iso-8859-15">
	<TITLE></TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 2.0  (Linux)">
	<META NAME="CREATED" CONTENT="20041212;19281200">
	<META NAME="CHANGED" CONTENT="20051219;14430800">
</HEAD>
<BODY LANG="de-DE" DIR="LTR">
<H2>HBCI Einrichtung Seite 4, Privater Schl&uuml;ssel</H2>
<H3>Schl&uuml;ssel selbst erzeugen</H3>
<P>Die sicherste Methode, einen privaten Schl&uuml;ssel (private key)
f&uuml;r die Daten&uuml;bertragung zu erhalten ist, ihn vom eigenen
Rechner erzeugen zu lassen. MoneyPenny erzeugt eine Schl&uuml;sseldatei
und speichert diese auf dem angegebenen Medium (Diskette oder
USB-Stick). Der Name der Datei setzt sich aus der Benutzerkennung,
die Sie eingegeben haben und der Dateiendung &quot;.key&quot;
zusammen. Am besten erstellen Sie eine Sicherheitskopie von dieser
Schl&uuml;sseldatei auf einer Diskette und legen die Diskette an
einem sicheren Platz ab. (Disketten kann man sogar in einen Ordner
einheften, wenn man die Schreibschutzsperre &ouml;ffnet.) 
</P>
<H3>Fertigen Schl&uuml;ssel verwenden</H3>
<P>Eventuell haben Sie eine private Schl&uuml;sseldatei(private key)
von Ihrer Bank erhalten. <BR>Verwenden sie nur private
Schl&uuml;sseldateien, die Sie auf dem Postwege erhalten oder die Sie
selbst auf einer Diskette abgeholt haben. &Uuml;<B>ber das Internet
(email) versendete private Schl&uuml;sseldateien sollten Sie auf gar
keinen Fall benutzen!</B> Siehe hierzu das Kapitel &uuml;ber
<A HREF="security.html">Sicherheit</A>. 

<H3>Chipkarte verwenden</H3>
Haben Sie eine HBCI-Chipkarte vom Typ DDV (Sparkassenkarte)
von Ihrer Sparkasse erhalten, so w&auml;hlen Sie den Eintrag "Ich habe eine Chipkarte..." aus. 
RSA-Chipkarten (VR-Networld) werden von MoneyPenny derzeit noch nicht unterst&uuml;tzt. F&uuml;r Ihre 
Volksbank m&uuml;ssen Sie eine Schl&uuml;sseldatei verwenden.
W&auml;hlen Sie den f&uuml;r Sie zutreffenden Knopf in der oberen Gruppe aus. 
</P>
<H3>HBCI-PIN-TAN</H3>
<P>
Für das PIN-TAN Verfahren wird für die Anmeldung nur eine PIN und eine beliebige 
Kontonummer des Benutzers gebraucht.
</P>
<H3>Wo ist der Schl&uuml;ssel?</H3>
<P>Wenn Sie einen Schl&uuml;ssel von Ihrer Bank erhalten haben,
befindet er sich wahrscheinlich auf einer Diskette. 
Fragen Sie Ihre
Bank nach dem Namen der Schl&uuml;sseldatei.<BR>
Bei einer Chipkarte befindet sich der Schl&uuml;ssel auf der Karte.<BR>
Wenn Sie einen
Schl&uuml;ssel mit MoneyPenny erzeugt haben, sichert MoneyPenny den
Schl&uuml;ssel als Benutzernummer.key Datei nach Ihrer Wahl auf Ihrer
Sicherheitsdiskette oder Ihrem USB-Stick. Der private Schl&uuml;ssel
sollte grunds&auml;tzlich nur auf einer Diskette oder einem USB-Stick
gespeichert werden. W&auml;hlen Sie in der unteren Box im
HBCI-Assistenten das entsprechende Medium aus. Da MoneyPenny unter
Linux l&auml;uft, sind die Pfadbezeichnungen f&uuml;r Windows-Kenner
etwas ungewohnt. Es gibt keine Laufwerksbuchstaben. Das Dateisystem
beginnt mit einem /. <BR>Die Pfade sind unterschiedlich, je nachdem,
ob MoneyPenny von der Life-CD oder unter einem normalen Linux l&auml;uft.
MoneyPenny schl&auml;gt den Pfad automatisch vor. Dr&uuml;cken Sie
auf den Knopf &quot;Schl&uuml;sseldatei von Hand suchen&quot; und
markieren Sie in dem Dialogfenster, das sich dann &ouml;ffnet, die
&quot;.key&quot; Datei mit Ihrem Schl&uuml;ssel. Normalerweise sollte
MoneyPenny schon das richtige Verzeichnis ge&ouml;ffnet haben. Sie
k&ouml;nnen aber auch von Hand das Verzeichnis wechseln. Dazu haben
wir in der folgenden Tabelle die wahrscheinlichen Pfade
eingetragen.<BR>Hinweis f&uuml;r Linux-Kenner: Es ist zwar m&ouml;glich,
den Schl&uuml;ssel mit MoneyPenny auf Ihre Festplatte zu schreiben,
Sie sollten dies aber aus Sicherheitsgr&uuml;nden unterlassen. 
</P>
<H3>Pfade zu den Speichermedien</H3>
<TABLE BORDER=1 CELLPADDING=2 CELLSPACING=2>
	<TR>
		<TH>
			<P><B>Medium</B></P>
		</TH>
		<TH>
			<P><B>Betrieb von CD</B></P>
		</TH>
		<TH>
			<P><B>Betrieb unter SuSE Linux</B></P>
		</TH>
	</TR>
	<TR>
		<TD>
			<P>Diskette</P>
		</TD>
		<TD>
			<P>/mnt/auto/floppy</P>
		</TD>
		<TD>
			<P>/media/floppy</P>
		</TD>
	</TR>
	<TR>
		<TD>
			<P>USB Stick</P>
		</TD>
		<TD>
			<P>/mnt/auto/sda1</P>
		</TD>
		<TD>
			<P>/media/usb</P>
		</TD>
	</TR>
</TABLE>
<P>Es empfiehlt sich, eine Kopie des privaten Schl&uuml;ssels an
einem sicheren Platz aufzubewahren. <B>Bitte kopieren Sie den
privaten Schl&uuml;ssel nie auf die Festplatte! Dort k&ouml;nnten ihn
Spionageprogramme lesen, wenn der Computer unter Windows l&auml;uft.</B>
</P>
<TABLE WIDTH=100% BORDER=1 CELLPADDING=4 CELLSPACING=3>
	<COL WIDTH=85*>
	<COL WIDTH=85*>
	<COL WIDTH=85*>
	<THEAD>
		<TR VALIGN=TOP>
			<TD WIDTH=33%>
				<P><!-- bottom navigator bar --><A HREF="index.html">zum
				Inhaltsverzeichnis</A></P>
			</TD>
			<TD WIDTH=33%>
				<P><A HREF="hbci_user.html">zur vorhergehenden Seite</A></P>
			</TD>
			<TD WIDTH=33%>
				<P><A HREF="hbci_check.html">zur n&auml;chsten Seite</A></P>
			</TD>
		</TR>
	</THEAD>
</TABLE>
<P><BR><BR>
</P>
</BODY>
</HTML>