<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=iso-8859-15">
	<TITLE></TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 1.1.1  (Linux)">
	<META NAME="CREATED" CONTENT="20041213;16464000">
	<META NAME="CHANGED" CONTENT="20060401;18184900">
</HEAD>
<BODY LANG="de-DE" DIR="LTR">
<H1><FONT FACE="Arial, sans-serif">Einleitung</FONT></H1>
<P><FONT FACE="Arial, sans-serif">Moneypenny ist ein Programm, mit
dem man &uuml;ber eine Datenverbindung Bankgesch&auml;fte abwickeln
kann. Es ist vor allem f&uuml;r die private Nutzung gedacht. Da man
mit einem solchen Programm bequem von zu Hause aus per Modem, ISDN
oder DSL seine Bankgesch&auml;fte erledigen kann, wird f&uuml;r
derartige Software meist die Bezeichnung &quot;Homebanking Programm&quot;
verwendet. Die derzeit noch geringe Verbreitung von Homebanking
Programmen wird nach Umfrageergebnissen vor allem durch
Sicherheitsbedenken der Kunden und zu schwierige Bedienung der
Programme verursacht. Sicherheitsbedenken werden zum gro&szlig;en
Teil durch</FONT> <FONT FACE="Arial, sans-serif">die sicherlich nicht
unbegr&uuml;ndeten Bedenken in Bezug auf Viren, Trojaner, Spyware und
&auml;hnliche Sabotageprogramme <FONT FACE="Arial, sans-serif">verursacht</FONT>,
die unter dem fast ausschlie&szlig;lich verwendeten Betriebssystem MS
Windows sehr verbreitet sind. Die Bedienbarkeit der Programme leidet
<FONT FACE="Arial, sans-serif">h&auml;ufig darunter</FONT>, dass die
Entwickler zu wenig Kontakte mit &quot;normalen&quot;
Benutzern hatten und zu wenig Arbeit in die Erprobung der
Benutzbarkeit gesteckt wurde. </FONT>
</P>
<P><FONT FACE="Arial, sans-serif">Die beiden oben angesprochenen
Probleme wollten wir bei der Entwicklung besonders ber&uuml;cksichtigen.
Deshalb sollte Moneypenny von Anfang an die h&ouml;chsten technisch
m&ouml;glichen <A HREF="technical_appendix.html">Sicherheitsstandards</A>
erf&uuml;llen und trotzdem m&ouml;glichst leicht zu bedienen sein.
Zur Erh&ouml;hung der Sicherheit wurde das Programm unter Verwendung
des Betriebssystems Linux, f&uuml;r das fast keine Sabotageprogramme
existieren und des HBCI (Home Banking Computer Interface) Standards
zur Daten&uuml;bertragung entwickelt. Der HBCI Standard und ab Mitte
2005 sein Nachfolger FinTS (Financial Transaction Services) wird in
Deutschland von den Volksbanken, den Sparkassen und vielen anderen
Banken unterst&uuml;tzt. </FONT>
</P>
<P><FONT FACE="Arial, sans-serif">Im Anhang finden Sie eine
Beschreibung der verwendeten <A HREF="technical_appendix.html">Technik</A>.
Eine umfangreichere Beschreibung der in Moneypenny realisierten
Sicherheitsma&szlig;nahmen finden Sie im Kapitel <A HREF="security.html">Sicherheitsma&szlig;nahmen</A>
in dieser Hilfe, oder f&uuml;r denjenigen, der es ganz genau wissen
will und der C++ Programme lesen kann, in den ver&ouml;ffentlichten
Quelltexten des Programms.</FONT></P>
<P><FONT FACE="Arial, sans-serif">Zur Verbesserung der <A HREF="usability.html/">Bedienbarkeit</A>
verf&uuml;gt Moneypenny &uuml;ber mehrere Steuerungsm&ouml;glichkeiten.
Das Programm wird normalerweise &uuml;ber ein Men&uuml;system
bedient, das &auml;hnlich wie aus dem Internet bekannt, am linken
Rand angeordnet ist. F&uuml;r die wichtigsten Funktionen sind
zus&auml;tzlich gro&szlig;e Schaltkn&ouml;pfe &uuml;ber dem
Hauptfenster vorhanden. Au&szlig;erdem kann ein normales
Kopfzeilen-Men&uuml; eingeschaltet werden. Vorzugsweise sollte
Moneypenny von der dazu vorgesehenen CD geladen werden, die nach dem
Einschalten des Rechners das Programm automatisch startet. Da die CD
ein komplettes Linux Betriebssystem enth&auml;lt, das durch
eventuelle Angriffe nicht ver&auml;ndert werden kann, ist dies die
sicherste Betriebsweise. Auch wenn sich auf dem Rechner ein mit
Sabotageprogrammen verseuchtes Windows befinden sollte, k&ouml;nnen
diese Programme unter Linux nicht aktiv werden. Au&szlig;erdem
braucht in diesem Falle auf dem Rechner kein Linux installiert zu
werden, was sicherlich f&uuml;r viele Benutzer von Vorteil ist. F&uuml;r
den ge&uuml;bten Linux Benutzer gibt es noch ein Kapitel <A HREF="linuxnotes.html">Betrieb
unter Linux</A>.</FONT></P>
<TABLE WIDTH=100% BORDER=1 CELLPADDING=4 CELLSPACING=3>
	<COL WIDTH=85*>
	<COL WIDTH=85*>
	<COL WIDTH=85*>
	<THEAD>
		<TR VALIGN=TOP>
			<TD WIDTH=33%>
				<P><A HREF="index.html">zum Inhaltsverzeichnis</A></P>
			</TD>
			<TD WIDTH=33%>
				<P><A HREF="index.html">zur vorhergehenden Seite</A></P>
			</TD>
			<TD WIDTH=33%>
				<P><A HREF="emergency.html">zur n&auml;chsten Seite</A></P>
			</TD>
		</TR>
	</THEAD>
</TABLE>
<P><BR><BR>
</P>
</BODY>
</HTML>
