<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=iso-8859-15">
	<TITLE>Sicherheitsmassnahmen</TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 2.0  (Linux)">
	<META NAME="CREATED" CONTENT="20041213;16464000">
	<META NAME="CHANGED" CONTENT="20051121;22254200">
</HEAD>
<BODY LANG="de-DE" DIR="LTR">
<H1>Sicherheitsma&szlig;nahmen</H1>
<P><BR><BR>
</P>
<H2>Passw&ouml;rter</H2>
<P>Die Daten auf der Diskette oder dem USB Stick werden verschl&uuml;sselt
und k&ouml;nnen nur mit den richtigen Passw&ouml;rtern entschl&uuml;sselt
werden. <B>Die St&auml;rke des Passwortschutzes ist dabei
entscheidend von Ihrer Wahl der beiden Passw&ouml;rter abh&auml;ngig.</B>
</P>
<P><B>Deshalb: </B>
</P>
<UL>
	<LI><P STYLE="margin-bottom: 0cm"><B>Verwenden Sie kein zu kurzes
	Passwort (mindestens 8 Zeichen) </B>
	</P>
	<LI><P STYLE="margin-bottom: 0cm"><B>Verwenden Sie bitte zwei
	verschiedene Passw&ouml;rter. Eines f&uuml;r die Anmeldung am
	Programm (Login) und ein weiteres f&uuml;r die Kommunikation mit der
	Bank (HBCI Daten&uuml;bertragung). </B>
	</P>
	<LI><P STYLE="margin-bottom: 0cm"><B>Verwenden Sie Kleinbuchstaben,
	Gro&szlig;buchstaben, Ziffern und Zeichen zum Beispiel: a-z, A-Z,
	0-9, +-:.()/&amp;${}\#*?%@ </B>
	</P>
	<LI><P><B>Vornamen sind denkbar ungeeignet. Die Liste der Vornamen
	ist in Bruchteilen einer Sekunde durchprobiert. </B>
	</P>
</UL>
<P>Beispiele f&uuml;r Passw&ouml;rter: 
</P>
<UL>
	<LI><P STYLE="margin-bottom: 0cm">Ganz schlecht: walter 
	</P>
	<LI><P STYLE="margin-bottom: 0cm">Schlecht: WalterRoth 
	</P>
	<LI><P STYLE="margin-bottom: 0cm">Besser: Walter.Prof.Dr.Roth 
	</P>
	<LI><P>Gut: ssGei/554.Hi 
	</P>
</UL>
<P>Das letzte Passwort besteht aus Omas M&auml;dchenamen etwas
umgestellt, einigen Ziffern ihrer Telefonnummer und einem Teil ihres
Geburtsorts. Es ist auch ausreichend lang und steht garantiert in
keinem W&ouml;rterbuch. So ein Passwort kann man sich noch relativ
gut merken, wenn man es oft genug verwendet. Tun Sie sich aber einen
Gefallen: Verwenden Sie keines der oben angef&uuml;hrten Beispiele!!
Auch andere lesen diesen Hilfetext. <BR><B>Anmerkung f&uuml;r
deutsche Benutzer:</B> Umlaute (&auml;&Auml;&ouml;&Ouml;&uuml;&Uuml;)und
&szlig; k&ouml;nnen auf einer deutschen Tastatur zwar problemlos
eingegeben werden, f&uuml;hren aber mit Sicherheit zu Problemen, wenn
man im Ausland auf einer englischen Tastatur arbeitet. 
</P>
<H3>Anzeige der Passwortsicherheit</H3>
<P>Die Eingabeseite f&uuml;r das HBCI Passwort enth&auml;lt eine
Anzeige zur Passwortsicherheit. MoneyPenny berechnet dazu bei jedem
neu eingegebenen Zeichen f&uuml;r das Passwort die Zahl der m&ouml;glichen
Passw&ouml;rter mit der verwendeten Zeichenmenge. Ab einer Anzahl von
10 Trillionen (10E16) wird gr&uuml;n angezeigt. Dies wird als
hinreichend sicher angesehen. (Der Balken zeigt den Logarithmus der
Anzahl an) 
</P>
<H3>Anmerkung zur Passwortsicherheit</H3>
<P><I>Vorausgesetzt, Sie haben ein Passwort aus 8 Zeichen mit nur
Kleinbuchstaben (24 m&ouml;gliche Zeichen) verwendet, so gibt es 24
hoch 8 = 110 075 314 176 = 1.1E11 M&ouml;glichkeiten f&uuml;r das
Passwort. Wenn man annimmt, dass nach der H&auml;lfte der Versuche
das Passwort gefunden wurde, so sind nur etwa 5.5E10 Versuche n&ouml;tig.
Mein ziemlich aktueller Computer (AMD Athlon 2600, Baujahr2004)
braucht daf&uuml;r bei optimaler Programmierung lediglich etwa 160000
Sekunden, also etwa 2 Tage. Erst wenn Sie auch Sonderzeichen, Ziffern
und Gro&szlig;buchstaben verwenden, so dass etwa 128 m&ouml;gliche
Zeichen im Passwort vorkommen k&ouml;nnen, steigt die Anzahl der zu
pr&uuml;fenden Passw&ouml;rter bei 8 Zeichen L&auml;nge auf etwa
7E16. Dies entspricht einer Ratedauer von 200 000 Tagen entsprechend
550 Jahren, was im Normalfalle als sicher angesehen werden kann.
Allerdings gilt dies nur unter der Annahme, dass das Passwort nicht
schnell erraten wird,weil es zum Beispiel in einem W&ouml;rterbuch
steht! Die etwa 500 000 Stichw&ouml;rter im Oxford Dictionary pr&uuml;ft
ein Computer in weniger als 10 Sekunden. Wenn das Passwort f&uuml;r
die Entschl&uuml;sselung der Diskette erraten wurde, kann die erste
Verschl&uuml;sselung des privaten Schl&uuml;ssels f&uuml;r die
Daten&uuml;bertragung aufgel&ouml;st werden. Diese Verschl&uuml;sselung
erfolgt mit dem Blowfish Algorithmus und dem Passwort, das f&uuml;r
die lokale Datensicherung und die Anmeldung am Programm verwendet
wird. Der Schl&uuml;ssel ist danach nur noch durch das HBCI-Passwort,
das hoffentlich vom ersten Passwort verschieden ist, gesch&uuml;tzt.
Erst wenn auch dieses Passwort erraten wird, k&ouml;nnen <A HREF="emergency.html">Unbefugte
den Schl&uuml;ssel verwenden.</A></I></P>
<H2>Schutz gegen Viren, Trojaner, Dialer, Spionageprogramme</H2>
<P>MON&euro;YP&euro;NNY sollte immer von seiner CD aus gestartet
werden. Legen Sie die CD ein, und fahren Sie den Computer herunter.
Bei &auml;lteren Computern schalten Sie den Computer von Hand aus.
Schalten Sie erneut ein. 
</P>
<P>Der Computer sollte jetzt das auf der MON&euro;YP&euro;NNY-Live-CD
befindliche Linux Betriebssystem starten und dann MON&euro;YP&euro;NNY
automatisch als einziges Programm starten. Diese Prozedur stellt
sicher, dass keinerlei Programme aktiv werden k&ouml;nnen, die sich
auf der Festplatte des Computers befinden. MON&euro;YP&euro;NNY
verwendet die Festplatte einschlie&szlig;lich des dort installierten
und eventuell verseuchten Betriebssystems (Windows) nicht. 
</P>
<P>Sollte es irgendwann einmal auch Viren f&uuml;r Linux geben, so
k&ouml;nnten auch diese nicht aktiv werden, denn die
MON&euro;YP&euro;NNY-Live-CD selber ist nicht beschreibbar. Deshalb
k&ouml;nnen sich dort prinzipiell keine Sabotageprogramme
installieren. 
</P>
<P>Auf diese Art und Weise erreicht MON&euro;YP&euro;NNY den
bestm&ouml;glichen Schutz gegen Sabotageprogramme aller Art. 
</P>
<P>Allerdings sollten Sie selbst auf eine wichtige Schwachstelle
moderner Computer achten: Wenn Sie Ihre Passw&ouml;rter auf einer
drahtlosen Funktastatur eingeben, so k&ouml;nnen diese mitgeh&ouml;rt
werden. Verwenden Sie also beim HomeBanking lieber eine alte Tastatur
mit Kabelanschluss. 
</P>
<P><BR><BR>
</P>
<H2>Schutz gegen Abh&ouml;ren der Internetverbindung</H2>
<P>Da das Internet in keiner Weise abh&ouml;rsicher ist, geht man
davon aus, dass die Daten auf dem &Uuml;bertragungsweg abgeh&ouml;rt
werden. MON&euro;YP&euro;NNY sendet die Daten zum Bankrechner deshalb
verschl&uuml;sselt. Der HBCI Standard, nach dem MON&euro;YP&euro;NNY
arbeitet, gilt als das sicherste Daten&uuml;bertragungsverfahren, das
derzeit f&uuml;r HomeBanking verwendet wird. 
</P>
<P>Beim HBCI-RDH Verfahren (mit Schl&uuml;sseldiskette oder
USB-Stick) werden die gleichen RSA Verschl&uuml;sselungsverfahren
angewendet, wie in dem bekannten Programm PGP (Pretty Good Privacy).
Diese Verschl&uuml;sselung wurde bis heute nicht gebrochen.
Zus&auml;tzlich werden die &uuml;bermittelten Daten noch mit dem
geheimen Signaturschl&uuml;ssel signiert und so gegen Verf&auml;lschung
doppelt gesichert. Man kann derzeit davon ausgehen, dass die Daten,
die den Rechner verlassen, nur mit dem richtigen Schl&uuml;ssel
gelesen werden k&ouml;nnen. In Zukunft wird das FinTS Verfahren
angewendet, das eine nochmals verst&auml;rkte Verschl&uuml;sselung
vorsieht. 
</P>
<P>Bei Benutzung einer HBCI-Chipkarte ist auf der Chipkarte ein
geheimer Schl&uuml;ssel gespeichert, der auch bei der Bank bekannt
ist. Mit diesem Schl&uuml;ssel werden f&uuml;r jede Daten&uuml;bertragung
neue Wechselschl&uuml;ssel erzeugt, mit denen dann die Daten f&uuml;r
die &Uuml;bertragung nach dem 3DES Verfahren verschl&uuml;sselt
werden. Auch diese Art der Verschl&uuml;sselung ist nicht zu brechen.
Da der Schl&uuml;ssel aber bei der Bank bekannt ist, k&ouml;nnen Sie
damit Ihre Auftr&auml;ge nicht rechtswirksam signieren.</P>
<H2>Schutz gegen Vertauschen des Schl&uuml;ssels</H2>
<P>Da das Internet in keiner Weise abh&ouml;rsicher ist, geht man
davon aus, dass die Daten auf dem &Uuml;bertragungsweg abgeh&ouml;rt
oder verf&auml;lscht werden k&ouml;nnen. Insbesondere kann der
&ouml;ffentliche Schl&uuml;ssel bei der Einreichung gegen einen
gef&auml;lschten Schl&uuml;ssel ausgetauscht werden, da Unbefugte
Zugriff auf den Datenstrom haben. Man spricht in diesem Falle von
einem &quot;Man in the Middle Attack&quot;, also einem Angriff durch
jemanden, der zwischen den beiden Computern die Datenleitung anzapft.
</P>
<P>Damit der Schl&uuml;ssel nicht durch Unbefugte, die die
Ersteinrichtung des Programms belauschen, ausgetauscht werden kann,
druckt MON&euro;YP&euro;NNY einen Brief (Ini-Brief), der die
Identit&auml;t des Schl&uuml;ssels zweifelsfrei belegt, und den Sie
am besten selbst bei Ihrer Bank abgeben. Dadurch werden &quot;Man in
the Middle&quot; Angriffe unm&ouml;glich.</P>
<P>Erst wenn sich die Bank durch den Ini-Brief davon &uuml;berzeugt
hat, dass der richtige Schl&uuml;ssel bei ihr angekommen ist, wird
sie die HBCI Verbindung freischalten. Deshalb n&uuml;tzt das
Austauschen des Schl&uuml;ssels dem Angreifer nichts, weil es auf
jeden Fall bemerkt wird und der Schl&uuml;ssel in diesem Falle nicht
freigeschaltet wird. Der Austausch des im HBCI Verfahren vorgesehenen
Ini-Briefs ist zwar aufw&auml;ndig, aber er gew&auml;hrleistet
zuverl&auml;ssig die Sicherheit der Datenverbindung. 
</P>
<P>Im Gegensatz dazu kann es bei der h&auml;ufig f&uuml;r HomeBanking
verwendeten Daten&uuml;bertragung mittels Internet-Browser &uuml;ber
eine verschl&uuml;sselte ssl Verbindung schon bei einem einzigen
falschen Mausklick zu einer dauerhaften Abh&ouml;rm&ouml;glichkeit
f&uuml;r den Angreifer kommen. Bei Versuchen aus Anlass einer Tagung
zur IT Sicherheit im Sommer 2004 haben 8 von 10 Informatikstudenten
genau diesen falschen Mausklick get&auml;tigt, obwohl sie wussten,
dass ein Angriff geplant war. Die Vielzahl der Warnmeldungen ist
einfach derartig verwirrend, dass man die entscheidende Warnung zu
leicht &uuml;bersieht. 
</P>
<H2>Literatur</H2>
<UL>
	<LI><P STYLE="margin-bottom: 0cm">Spektrum der Wissenschaft, Dossier
	4/2001 &quot;Kryptographie&quot; <BR>Gut lesbare Einf&uuml;hrung in
	die Kryptographie, einschlie&szlig;lich der Mathematik f&uuml;r RSA 
	</P>
	<LI><P STYLE="margin-bottom: 0cm">Simon Singh,&quot;Geheime
	Botschaften&quot;, DTV Verlag<BR>Spannendes Buch &uuml;ber
	Kryptographie, sehr gut lesbar und technisch korrekt. 
	</P>
	<LI><P STYLE="margin-bottom: 0cm">www.hbci.org<BR>Die originale
	Dokumentation des HBCI und FinTS Verfahrens 
	</P>
	<LI><P STYLE="margin-bottom: 0cm">www.openssl.org<BR>Die
	Dokumentation der OpenSSL Bibliothek 
	</P>
	<LI><P STYLE="margin-bottom: 0cm">Dietmar W&auml;tjen,
	&quot;Kryptographie&quot;, Spektrum Akademischer Verlag 2004<BR>F&uuml;r
	denjenigen, der es ganz genau wissen will und sehr gute
	mathematische Kenntnisse hat 
	</P>
	<LI><P>Gerd Siegmund, &quot;Technik der Netze&quot;, H&uuml;thig
	Verlag 2002<BR>Sehr ausf&uuml;hrliche &Uuml;bersicht &uuml;ber die
	moderne Daten&uuml;bertragung 
	</P>
</UL>
<TABLE WIDTH=100% BORDER=1 CELLPADDING=4 CELLSPACING=3>
	<COL WIDTH=85*>
	<COL WIDTH=85*>
	<COL WIDTH=85*>
	<TR VALIGN=TOP>
		<TD WIDTH=33%>
			<P><A HREF="index.html">zum Inhaltsverzeichnis</A></P>
		</TD>
		<TD WIDTH=33%>
			<P><A HREF="requirements.html">zur vorhergehenden Seite</A></P>
		</TD>
		<TD WIDTH=33%>
			<P><A HREF="usability.html">zur n&auml;chsten Seite</A></P>
		</TD>
	</TR>
</TABLE>
<P><BR><BR>
</P>
</BODY>
</HTML>
