<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=iso-8859-1">
	<TITLE>Umsaetze</TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 1.1.1  (Linux)">
	<META NAME="CREATED" CONTENT="20041213;16464000">
	<META NAME="CHANGED" CONTENT="20050320;20273900">
</HEAD>
<BODY LANG="de-DE" DIR="LTR">
<H1>Liste der Kontobewegungen anzeigen und drucken</H1>
<P><BR><BR>
</P>
<P>Eine weitere wichtige Funktion des HomeBankings, Ums&auml;tze
eines Kontos abzuholen und einzusehen, finden Sie unter dem Men&uuml;punkt
&quot;Kontoums&auml;tze&quot;. 
</P>
<P>Sie haben dort Zugriff auf die drei Funktionen:<BR>•
Kontoums&auml;tze abholen<BR>• Ums&auml;tze anzeigen<BR>• Ums&auml;tze
drucken</P>
<P><BR><BR>
</P>
<H2>Ums&auml;tze abholen</H2>
<P>Klicken Sie auf Kontoums&auml;tze -&gt; Kontoums&auml;tze abholen,
um ein Dialogfenster zur Abholung der Ums&auml;tze aufzurufen.  Sie
w&auml;hlen zun&auml;chst, ob Sie f&uuml;r alle Konten oder f&uuml;r
ein bestimmtes Konto Ums&auml;tze abholen m&ouml;chten. Zus&auml;tzlich
k&ouml;nnen Sie angeben, ob die Daten nur aktualisiert werden sollen
oder ob Sie Ums&auml;tze eines bestimmten Zeitraums einsehen m&ouml;chten.
Mit Klick auf OK wird ihre Anfrage entweder sofort bearbeitet oder in
der Auftragsliste gespeichert, wenn Sie im folgenden Dialog entweder
auf &quot;Jetzt&quot; oder &quot;Sp&auml;ter“ klicken. 
</P>
<P>Eine Tabelle mit den aktuellen Ums&auml;tzen wird nach Ausf&uuml;hrung
des Auftrags angezeigt. 
</P>
<P><BR><BR>
</P>
<H2>Ums&auml;tze anzeigen</H2>
<P>Klicken Sie auf Kontoums&auml;tze -&gt; Ums&auml;tze anzeigen oder
alternativ auf den Schnellstartbutton &quot;Rotes Formular&quot; und
Sie erhalten eine tabellarische &Uuml;bersicht &uuml;ber die Ums&auml;tze
f&uuml;r das aktuelle Konto. Oben rechts wird die Kontonummer
angezeigt sowie eine Aufklappliste in der Sie einen bestimmten
Zeitraum w&auml;hlen k&ouml;nnen, um die &Uuml;bersicht zu wahren. 
</P>
<P>Die tabellarische &Uuml;bersicht umfasst eine sortierte Liste
durchnummerierter Ums&auml;tze. Dabei werden Angaben zu Datum, Name,
Verwendungszweck, Kommentar, Bankleitzahl, Kontonummer und Betrag
angezeigt. 
</P>
<P>Unter der Tabelle finden Sie au&szlig;erdem eine Zusammenfassung
der Einnahmen und Ausgaben als Summe der Ums&auml;tze des gew&auml;hlten
Zeitraums. Sie haben dar&uuml;ber hinaus die M&ouml;glichkeit, &uuml;ber
die beiden Kn&ouml;pfe am unteren Rand diese Liste auszudrucken bzw.
zu aktualisieren. 
</P>
<P><BR><BR>
</P>
<H2>Ums&auml;tze drucken</H2>
<P>Klicken Sie auf Kontoums&auml;tze -&gt; Ums&auml;tze drucken, um
eine Druckvorschau f&uuml;r die aktuellen Ums&auml;tze anzeigen zu
lassen. Die Tabelle entspricht dabei weitestgehend der aus der
Funktion &quot;Ums&auml;tze anzeigen&quot;. Es werden zudem das Datum
und die Seitenzahl eingef&uuml;gt.</P>
<P>Mit dem Knopf &quot;Drucken&quot; drucken Sie das Dokument sofort
aus. Stellen Sie sicher, dass ihr Drucker eingeschaltet ist und
Papier vorhanden ist.  Mit dem Knopf &quot;Druckoptionen anzeigen&quot;
k&ouml;nnen Sie weitere Druckoptionen anzeigen lassen, in denen Sie
z.B. die Druckerschriftart ver&auml;ndern k&ouml;nnen.</P>
<P>Mit dem Knopf &quot;Druckereinrichtung&quot; gelangen Sie in einen
weiteren Dialog, in dem Sie Einstellungen f&uuml;r den Drucker
vornehmen k&ouml;nnen. 
</P>
<P>Der Knopf  &quot;Hilfe&quot; gibt ihnen weitere Informationen zum
Druckvorgang. 
</P>
<P>Mit dem Button &quot;Knopf&quot; k&ouml;nnen Sie auf Wunsch auch
den Druck abbrechen, sofern die Daten noch nicht an den Drucker
geschickt wurden.. 
</P>
<P STYLE="margin-bottom: 0in"><BR>
</P>
<TABLE WIDTH=100% BORDER=1 CELLPADDING=4 CELLSPACING=3>
	<COL WIDTH=85*>
	<COL WIDTH=85*>
	<COL WIDTH=85*>
	<TR VALIGN=TOP>
		<TD WIDTH=33%>
			<P><A HREF="index.html">zum Inhaltsverzeichnis</A></P>
		</TD>
		<TD WIDTH=33%>
			<P><A HREF="transfers.html">zur vorhergehenden Seite</A></P>
		</TD>
		<TD WIDTH=33%>
			<P><A HREF="dataexport.html">zur n&auml;chsten Seite</A></P>
		</TD>
	</TR>
</TABLE>
<P><BR><BR>
</P>
</BODY>
</HTML>
